others/3/report.org
# This is a Bibtex reference
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:t arch:headline ^:nil
#+OPTIONS: author:t broken-links:nil c:nil creator:nil
#+OPTIONS: d:(not "LOGBOOK") date:nil e:nil email:nil f:t inline:t num:t
#+OPTIONS: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+OPTIONS: timestamp:nil title:t toc:nil todo:t |:t
#+TITLE: 情報科学概論
#+DATE: 
#+AUTHOR: 情報科学類二年 江畑 拓哉(201611350)
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 24.5.1 (Org mode 9.0.
#+LATEX_CLASS: koma-article
#+LATEX_CLASS_OPTIONS: 
#+LATEX_HEADER_EXTRA: \bibliography{reference}
#+LaTeX_CLASS_OPTIONS:
#+DESCRIPTION:
#+KEYWORDS:
#+SUBTITLE:
#+STARTUP: indent overview inlineimages

* 以下サイト内のコンセプトビデオを視聴して、下記の課題を行い、レポートとして提出せよ。
  1. どのような機能があることになっているか？描かれている機能を列挙せよ。
  2. 1の各機能をビデオのように実現するためには、どのような技術が必要か？1の各機能毎に推測せよ。
  3. 2で上げた各技術のうちどれだけが現在既に開発されている技術だろうか？実現済みだと思う技術には○、これからの技術にはXをつけてみよう。

    既に当然のようにある技術については記載してない。(例：デュアルディスプレイ)

#+ATTR_LATEX: :environment tabular :width 15cm :align ||c||c||c||
|--------------------------------------------+------------------------------------------+----|
|--------------------------------------------+------------------------------------------+----|
| 1                                          | 2                                        | 3  |
|--------------------------------------------+------------------------------------------+----|
|--------------------------------------------+------------------------------------------+----|
| AR（拡張現実）による海藻などの分類         | AR                                       | ○ |
|                                            | 植物の分類のためのデータ解析             | ○ |
|                                            | 認識したいものを判別するためのデータ解析 | X |
|--------------------------------------------+------------------------------------------+----|
| サンプルデータの搾取とその場での解析       | 携帯高額分析器                           | X |
|--------------------------------------------+------------------------------------------+----|
| 3Dプリンタでの入手した画像の復元           | 3Dプリンタ　                             | ○ |
|--------------------------------------------+------------------------------------------+----|
| 360度超高精細カメラ                        | 左に同じ                                 | X |
|--------------------------------------------+------------------------------------------+----|
| 彼我の距離を把握した上でのディスプレイ接続 | 位置センサー                             | ○ |
|--------------------------------------------+------------------------------------------+----|
| 柔軟な素材を用いたディスプレイ             | 歪曲可能な液晶パネル                     | ○ |
|                                            | 有機EL                                   | ○ |
|                                            | タッチパネル                             | ○ |
|                                            | ペンデバイス                             | ○ |
|--------------------------------------------+------------------------------------------+----|
| ガラスにディスプレイを鮮明に表示する       | 投影技術                                 | X |
|                                            | 光度センサー                             | ○ |
|--------------------------------------------+------------------------------------------+----|
| ガラス面におけるタッチを認識               | 距離センサー                             | ○ |
|                                            | 人を正確に認識するカメラ                 | ○ |
|--------------------------------------------+------------------------------------------+----|
| 腕時計型携帯端末                           | 小型計算機                               | ○ |
|--------------------------------------------+------------------------------------------+----|
| セキュリティの高い公共PC                   | データの秘匿                             | X |
|--------------------------------------------+------------------------------------------+----|
| 文字の認識                                 | 正確なパターン認識                       | X |
|--------------------------------------------+------------------------------------------+----|
| ヒトの体の機能についての分析               | 簡易型MRI                                | X |
|                                            | 熱感センサー                             | ○ |
|                                            | 継続的なデータ解析                       | ○ |
|--------------------------------------------+------------------------------------------+----|
| 3Dディスプレイ                             | 投影技術                                 | X |
|--------------------------------------------+------------------------------------------+----|
| ジェスチャー認識                           | 動作についての機械学習                   | X |
|                                            | 距離センサー                             | ○ |
|--------------------------------------------+------------------------------------------+----|
| 半自動操縦ロボット                         | 高速な通信                               | ○ |
|                                            | 障害物を避けるためのデータ蓄積と機械学習 | X |
|--------------------------------------------+------------------------------------------+----|
|--------------------------------------------+------------------------------------------+----|
