others/3/report.tex
% Intended LaTeX compiler: pdflatex
\documentclass{scrartcl}
    \usepackage[dvipdfm]{geometry}
		\usepackage[utf8]{inputenc}
		\usepackage[dvipdfmx]{graphicx}
		\usepackage[dvipdfmx]{color}
		\usepackage[backend=biber,bibencoding=utf8]{biblatex}
		\usepackage{url}
		\usepackage{indentfirst}
		\usepackage[normalem]{ulem}
		\usepackage[dvipdfmx]{hyperref}
		\usepackage{longtable}
		\usepackage{minted}
		\usepackage{fancyvrb}
		\bibliography{reference}
\author{情報科学類二年 江畑 拓哉(201611350)}
\date{}
\title{情報科学概論}
\begin{document}

\maketitle

\section{以下サイト内のコンセプトビデオを視聴して、下記の課題を行い、レポートとして提出せよ。}
\label{sec:orgd41f192}
\begin{enumerate}
\item どのような機能があることになっているか？描かれている機能を列挙せよ。\\
\item 1の各機能をビデオのように実現するためには、どのような技術が必要か？1の各機能毎に推測せよ。\\
\item 2で上げた各技術のうちどれだけが現在既に開発されている技術だろうか？実現済みだと思う技術には○、これからの技術にはXをつけてみよう。\\

既に当然のようにある技術については記載してない。(例：デュアルディスプレイ)\\
\end{enumerate}

\begin{center}
\begin{tabular}{||c||c||c||}
\hline
\hline
1 & 2 & 3\\
\hline
\hline
AR（拡張現実）による海藻などの分類 & AR & ○\\
 & 植物の分類のためのデータ解析 & ○\\
 & 認識したいものを判別するためのデータ解析 & X\\
\hline
サンプルデータの搾取とその場での解析 & 携帯高額分析器 & X\\
\hline
3Dプリンタでの入手した画像の復元 & 3Dプリンタ　 & ○\\
\hline
360度超高精細カメラ & 左に同じ & X\\
\hline
彼我の距離を把握した上でのディスプレイ接続 & 位置センサー & ○\\
\hline
柔軟な素材を用いたディスプレイ & 歪曲可能な液晶パネル & ○\\
 & 有機EL & ○\\
 & タッチパネル & ○\\
 & ペンデバイス & ○\\
\hline
ガラスにディスプレイを鮮明に表示する & 投影技術 & X\\
 & 光度センサー & ○\\
\hline
ガラス面におけるタッチを認識 & 距離センサー & ○\\
 & 人を正確に認識するカメラ & ○\\
\hline
腕時計型携帯端末 & 小型計算機 & ○\\
\hline
セキュリティの高い公共PC & データの秘匿 & X\\
\hline
文字の認識 & 正確なパターン認識 & X\\
\hline
ヒトの体の機能についての分析 & 簡易型MRI & X\\
 & 熱感センサー & ○\\
 & 継続的なデータ解析 & ○\\
\hline
3Dディスプレイ & 投影技術 & X\\
\hline
ジェスチャー認識 & 動作についての機械学習 & X\\
 & 距離センサー & ○\\
\hline
半自動操縦ロボット & 高速な通信 & ○\\
 & 障害物を避けるためのデータ蓄積と機械学習 & X\\
\hline
\hline
\end{tabular}
\end{center}
\end{document}